[
    {
        "title": "IBHL Project: Japanese Culture Club App",
        "year": "2022",
        "image": "../images/Flag of Japan.png",
        "description": "An app coded for the International Baccalureate HL Computer Science Program with Java and SQLite designed to help the Japanese Culture Club schedule events and track attendance."
    },
    {
        "title": "DS3 FA23 Workshop 3: Introduction to Backend",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A workshop hosted by the Data Science Student Society to teach undergraduate students the fundamentals of backend development."
    },
    {
        "title": "Rucio-SENSE DMM",
        "year": "2024", 
        "image": "../images/dmm.png",
        "description": "Data Movement Manager (DMM) for the Rucio-SENSE interoperation prototype. DMM is the interface between Rucio (/FTS) and SENSE, making SDN operated HEP data-flows possible. Based on the relative priorities of the datasets we construct peer-to-peer private vlans with respective dedicated bandwidths to ensure we have accountability in the use of resources."
    },
    {
        "title": "DS3 SP24 Workshop 4: Introduction to Flask",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A workshop hosted by the Data Science Student Society illustrating the use of Flask to build personal websites."
    },
    {
        "title": "Recipes Rating Classifier",
        "year": "2024", 
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A classifier designed to rate recipes based on their features. Done in collaboration with Emma Leung."
    },
    {
        "title": "Bandwidth Allocation Testing",
        "year": "2024",
        "image": "../images/dmm.png",
        "description": "Repository for the research and testing of the bandwidth allocation algorithm for the Rucio-SENSE DMM."
    },
    {
        "title": "COGS 108 Final Project: Gamification in Education",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "An exploration of the effects of gamified learning on standardized test scores. Done in collaboration with Hew Yeh, Kendall Underwood, Megha Kumar, and Jasmin Taylor."
    },
    {
        "title": "IBM Accelerate Green Garden Case Study",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Findings from IBM Accelerate Consulting Track's Green Garden Case Study."
    },
    {
        "title": "DS3 FA24 Workshop 1: Build Your Own Project",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A workshop hosted by the Data Science Student Society designed to help students set up the coding environment for data science projects."
    },
    {
        "title": "HDSI x Deloitte: Optimizing Revenue with ML",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Under the Halicioglu Data Science Institute students and mentorship by Deloitte consultants, collaborated with fellow data science students to develop machine learning models to increase profits in real-world case study."
    },
    {
        "title": "DS3 WI25 Workshop 1: Introduction to Scikit-Learn",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Nesciunt ex eum officiis ducimus enim sint impedit. Ipsum voluptatum, quam cumque nihil consequuntur omnis aspernatur vero deserunt a cum rerum sed fugiat nesciunt ut debitis repellendus eaque sequi eius."
    },
    {
        "title": "Biological Evaluation in Data Science",
        "year": "2025", 
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Exploration of healthcare in data science."
    }
]